Terraform Plan Output:
```
data.oci_identity_compartment.parent: Reading...
data.oci_identity_compartment.parent: Read complete after 2s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_identity_compartment.test_compartment will be created
  + resource "oci_identity_compartment" "test_compartment" {
      + compartment_id = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Intermediate Root Compartment for the OpenLZ Project"
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-root-openlz"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```